In [2]:
#사드 배치의 영향으로 중국인 관광객이 얼마나 줄었을까?

In [9]:
#외국인 출입국 통계 데이터 구하기 - 한국관광공사에 나온 기초 자료를 토대로 활용
#https://kto.visitkorea.or.kr/kor/notice/data/statis/profit/notice/inout/popup.kto 에서 19년 1월 기준으로 가져옴

import pandas as pd #pandas 라이브러리 불러오기
kto_201901 = pd.read_excel(r'C:\Users\82104\Desktop\프로그래밍\파이썬 자료\kto_201901.xlsx', 
# \로 구성된 자료주소는 r을 앞에 붙여서 자료를 가져올 것
                            header = 1, # 두 번째 줄에 있는 것을 변수명으로 가져온다. 
                            usecols = 'A:G', # 전년동기, 성장률, 구성비를 제외한 값들을 가져오기
                            skipfooter = 4 # 맨 아래 4줄은 생략
                            )
kto_201901.head()

     국적      관광     상용    공용  유학/연수      기타       계
0  아시아주  765082  10837  1423  14087  125521  916950
1    일본  198805   2233   127    785    4576  206526
2    대만   86393     74    22    180    1285   87954
3    홍콩   34653     59     2     90    1092   35896
4   마카오    2506      2     0     17      45    2570

In [11]:
kto_201901.tail()

         국적   관광   상용  공용  유학/연수     기타      계
62  아프리카 기타  768  718  90    206    908   2690
63     기타대륙   33    4   0      1     16     54
64     국적미상   33    4   0      1     16     54
65     교포소계    0    0   0      0  15526  15526
66       교포    0    0   0      0  15526  15526

In [13]:
# 데이터 전처리 하기 = 데이터를 탐색하고, 분석에 적합한 과정으로 만들기 == 데이터 가공, 데이터 클렌징, 데이터 핸들링과 같은 의미
# 데이터 변수별로 이상이 있는가? 결측값 처리, 이상치 처리, 변수 정규화, 파생변수 생성

# 정보 보기 R에서는 str()로 표현
kto_201901.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적      67 non-null     object
 1   관광      67 non-null     int64
 2   상용      67 non-null     int64
 3   공용      67 non-null     int64
 4   유학/연수   67 non-null     int64
 5   기타      67 non-null     int64
 6   계       67 non-null     int64
dtypes: int64(6), object(1)
memory usage: 3.8+ KB

In [14]:
#describe() 함수 - R에서 summary 함수와 비슷한 역할
kto_201901.describe()

,관광,상용,공용,유학/연수,기타,계
count,67.00000,67.000000,67.000000,67.000000,67.000000,67.000000
mean,26396.80597,408.208955,132.507463,477.462687,5564.208955,32979.194030
std,102954.04969,1416.040302,474.406339,2009.484800,17209.438418,122821.369969
min,0.00000,0.000000,0.000000,0.000000,16.000000,54.000000
25%,505.00000,14.500000,2.500000,17.500000,260.000000,927.000000
50%,1304.00000,45.000000,14.000000,43.000000,912.000000,2695.000000
75%,8365.00000,176.500000,38.000000,182.000000,2824.500000,14905.500000
max,765082.00000,10837.000000,2657.000000,14087.000000,125521.000000,916950.000000

In [35]:
# 0으로 입력된 데이터는 무엇이 있는가? 
print("조건 필터 연산자는 == 으로 표현 ")
condition = (kto_201901['상용'] == 0)  \
            | (kto_201901['관광'] == 0) \
            | (kto_201901['공용'] == 0) \
            | (kto_201901['유학/연수'] == 0) 
kto_201901[condition]

조건 필터 연산자는 == 으로 표현

        국적     관광   상용  공용  유학/연수     기타      계
4      마카오  86393    2   0     17     45   2570
20    이스라엘  86393   12   0      9     57    805
22  우즈베키스탄  86393  561   0    407   2828   5754
38     스위스  86393   18   0     19     97    747
45     그리스  86393   17   4      0    273    775
46    포르투갈  86393   14   0     13    121    564
51   크로아티아  86393   12   0      3    250    491
54     폴란드  86393   10   0     27    574   1324
59  대양주 기타  86393    3   4      0     52    614
63    기타대륙  86393    4   0      1     16     54
64    국적미상  86393    4   0      1     16     54
65    교포소계  86393    0   0      0  15526  15526
66      교포  86393    0   0      0  15526  15526

In [42]:
#기준년월 칼럼 생성
kto_201901['기준년월'] = '2019-01'
kto_201901.head()

     국적     관광     상용    공용  유학/연수      기타       계     기준년월
0  아시아주  86393  10837  1423  14087  125521  916950  2019-01
1    일본  86393   2233   127    785    4576  206526  2019-01
2    대만  86393     74    22    180    1285   87954  2019-01
3    홍콩  86393     59     2     90    1092   35896  2019-01
4   마카오  86393      2     0     17      45    2570  2019-01

In [44]:
# 국적이 무엇이 있는가? unique 함수
kto_201901['국적'].unique()

array(['아시아주', '일본', '대만', '홍콩', '마카오', '태국', '말레이시아', '필리핀', '인도네시아',
       '싱가포르', '미얀마', '베트남', '인도', '스리랑카', '파키스탄', '방글라데시', '캄보디아', '몽골',
       '중국', '이란', '이스라엘', '터키', '우즈베키스탄', '카자흐스탄', 'GCC', '아시아 기타', '미주',
       '미국', '캐나다', '멕시코', '브라질', '미주 기타', '구주', '영국', '독일', '프랑스',
       '네덜란드', '스웨덴', '스위스', '이탈리아', '덴마크', '노르웨이', '벨기에', '오스트리아', '스페인',
       '그리스', '포르투갈', '핀란드', '아일랜드', '우크라이나', '러시아', '크로아티아', '루마니아',
       '불가리아', '폴란드', '구주 기타', '대양주', '오스트레일리아', '뉴질랜드', '대양주 기타',
       '아프리카주', '남아프리카공화국', '아프리카 기타', '기타대륙', '국적미상', '교포소계', '교포'],
      dtype=object)

In [52]:
#대륙 목록 만들기
continents_list = ['아시아주','미주','구주','대양주','아프리카주','기타대륙','교포소계']
continents_list

['아시아주', '미주', '구주', '대양주', '아프리카주', '기타대륙', '교포소계']

In [60]:
#대륙 목록에 해당하는 값들은 제외
condition =(kto_201901.국적.isin(continents_list) == False)
kto_201901_country = kto_201901[condition]
kto_201901_country['국적'].unique()

array(['일본', '대만', '홍콩', '마카오', '태국', '말레이시아', '필리핀', '인도네시아', '싱가포르',
       '미얀마', '베트남', '인도', '스리랑카', '파키스탄', '방글라데시', '캄보디아', '몽골', '중국',
       '이란', '이스라엘', '터키', '우즈베키스탄', '카자흐스탄', 'GCC', '아시아 기타', '미국',
       '캐나다', '멕시코', '브라질', '미주 기타', '영국', '독일', '프랑스', '네덜란드', '스웨덴',
       '스위스', '이탈리아', '덴마크', '노르웨이', '벨기에', '오스트리아', '스페인', '그리스', '포르투갈',
       '핀란드', '아일랜드', '우크라이나', '러시아', '크로아티아', '루마니아', '불가리아', '폴란드',
       '구주 기타', '오스트레일리아', '뉴질랜드', '대양주 기타', '남아프리카공화국', '아프리카 기타',
       '국적미상', '교포'], dtype=object)